void m2() {
  int Gain = 1600;
  Track(20, 0.09, 0.15);
  readTag();
  ReadLine();
  if (s[0] < 400 && s[1] < 400 && s[2] < 400 && s[3] < 400) {  //เจอดำหมด
    beep();
    if (T0 < Gain && T3 > Gain) {  //เจอเขียวซ้าย
      sound(1000, 100);
      SpinL();  //เลี้ยวซ้าย
    }
    if (T0 > Gain && T3 < Gain) {  //เจอเขียวขวา
      sound(2000, 200);
      SpinR();  //เลี้ยวขวา
    }
    if (T0 < Gain && T3 < Gain) {  //เจอเขียวซ้ายและเจอเขียวขวา
      sound(3000, 300);
      //FF(40, 0.11, 0.09, 's', 50);
      Uturn();  //หมุนตัวกลับ
    }
    if (T0 > Gain && T3 > Gain) {    //ไม่เจอเขียวซ้ายและไม่เจอเขียวขวา
      FF(50, 0.11, 0.09, 'p', 100);  //เดินหน้าเลยเส้น
    }
  
    //while (1) MotorStop();
  }
}